                                                            *** Git ***

* ملف الجيتجنور بيعمل تجاهل للفولدرات اللي بتبقا موجوده في اي مشروع زي الفيندور موجود الكمبوزر في اي حدي هيعمل كومبوزر
دامب اوتو لود هينزل معاه .
* git add . ده بيضيف كل الفولدرات والفايلز بتاعه المشروع كله عدا الموجود في الجيت اجنور .
* git add readme .md  عشان لو عايز تكتب ازاي تستب المشروع
لو طلب منك كونفيج ايميل وكونفيح يوزر نيم عشان يعرف انت مين اللى هتنفذ الامر بتاعك  *
* git checkout -b begin لعمل برانش جديد .
* git branch عشان تعمل برانش جديد


** رفع مشروع git hup **
* git init .
* git add .
* git add README.md.
* git commit -m "first commit".
* git checkout -b branch name  .
* git branch عشان اعرف البرنشات اللى عندك .

لو عايز تعمل ميرج ريكويست من البيجن للمستر مثلا هتعملها انك بتقف ف الاول ع اكونت بيجين وتعمل بل ريكويست
