                                                **** Packages ****
                                       ** astrotomic/laravel-translatable **
الباكدج دي بتستخدم كتير جدا في الترجمه *
استخدامها بيكون في Model نفسه *
الباكدج دي تبع الادمن بتعمل من كل تيبل 2 تيبل تيبل في الكي اللى مش هتترجم والتيبل التاني في كل حاجه حاجه هتترجم
علي سبيل المثال كاتيجور ترانسليشن هيكون فيها كاتيجور اي دي هيشير للكاتيجوري وهيكرر الاسم مره عربي ومره انجلش .
اول امر في اي باكدج بياخد الكود بتاع الباكدج يحطه في الفيندور .
تقريبا ع حسب لغه الموقع اللى في الكونفيج اب بيسف ع حسب اللغه في الباكدج دي *
                                            *** mcamera laravel localization  ***
باكدج لترجمه السايت *
اي راوت عايزه يترجمه هتحطه جوا ميدل وير الخاصه بيها *
                                           *** yajra/laravel-datatables  ***
هتفيدنا في جداول الادمن في الباجينيشن وعرض ع حسب العدد *
