                                                    ** Public Information **
هيلبر ميثود اللى اسمها اسيست دي وظيفتها اللى تخليك تقرا ملفات سي اس اس وجافا سكريبت من اي حته لو مستخدمتهاش
 هتقرا من الاندكس بس .
* php artisan config:cache ده عشان يسمع اي تغييرات عملتها في ملف الانف .
* ميثود داون اللى في تيبل الميجريشن هي اللى بتحذف التيبل لما بعمل رول باك .
* Casts تستخدم في الموديل لو عايز تغير التايب بتاع فيلد .
* self معناها ان الميثود دي داخل الكلاس ده .
* this مش هتنفع تستخدمها مع ستاتيك هتستخدم سيلف .
* array conversion string دي معناها ان الفيلد ده نوعه سترينج او فار كار وانت عايز تخزن فيه اري وحلها انك تعمله
json_encode .
اي ملف انف او كونفجريشن يفضل بعد متشتغل فيه php artisan config:cache *
طالما عملت ملف هيلبر لازم تكتبه في كومبوزر دوت جسون عشان يسمع وبعدين تعمل كومبوزر دامب اوتو لود *
